def f(n):
    n2 = bin(n)[2:]
    R = ''
    if n2.count('0') > 0:
        R = bin(n2.count('0'))[2:]
    if n2.count('1') > 0:
        R += bin(n2.count('1'))[2:]
    return int(R,2)

'''
214 = 11010110

110101 = 53 нуля
10 = 2 единицы
55 разрядов
'1' '0'*53 + '1'

11010 26
110 = 6
32 разряда

110 = 6 
10110 = 22
28 разрядов
s= '1' + '0'*6 + '1'*21

1 = 1
1010110 = 86
'''
s= '1' + '0'*6 + '1'*21
print(int(s,2))
for i in range (136314000,10_000_000_000):
    if f(i) == 214:
        print(i)
        break
